In [1]:
import numpy as np
import pandas as pd

In [2]:
customer_tb = pd.read_csv('customer.csv')
print(customer_tb.shape)
customer_tb.head()

(1000, 5)

  customer_id  age    sex  home_latitude  home_longitude
0         c_1   41    man      35.092193      136.512347
1         c_2   38    man      35.325076      139.410551
2         c_3   49  woman      35.120543      136.511179
3         c_4   43    man      43.034868      141.240314
4         c_5   31    man      35.102661      136.523797

In [3]:
customer_tb['age_rank'] = (np.floor(customer_tb['age'] / 10) *10).astype('category')
customer_tb.head()

  customer_id  age    sex  home_latitude  home_longitude age_rank
0         c_1   41    man      35.092193      136.512347     40.0
1         c_2   38    man      35.325076      139.410551     30.0
2         c_3   49  woman      35.120543      136.511179     40.0
3         c_4   43    man      43.034868      141.240314     40.0
4         c_5   31    man      35.102661      136.523797     30.0